Merge pull request #53 from frmscoe/license-header
docs: add license header
