--- a/Product/processor-results-propagation.md
+++ b/Product/processor-results-propagation.md
@@ -13,122 +15,42 @@
 ## Processor results sequence diagram
 
 Array of rule evaluation results
-```plantuml
-@startuml
-'PREVIEW WITH ALT-D ;
+```mermaid
+%%{init: {'themeVariables': {'backgroundColor': '#ffffff', 'nodeBorder': 'none', 'mainBkg': '#ffffff', 'lineColor': '#000000', 'borderWidth': '2px', 'arrowheadSize': '1em'}}}%%
+sequenceDiagram
+    participant rules as "Rules Processor"
+    participant typologies as "Typology Processors"
+    participant tadp as "Transaction Aggregation & Decisioning Processor"
+    participant cms as "Case Management"
 
-/'*****
-License
---------------
-Copyright (c) 2021 LexTego
---------------
-******'/
+    activate rules
+    rules ->> rules: Execute rule
+    rules ->> typologies: Submit rule result
+    Note left of rules: Rule results include:<br/>* Original transaction data<br/>* Network sub-map<br/>* Rule evaluation results<br/>** Rule processor identifier<br/>** Rule configuration version<br/>** Sub-rule reference<br/>** Rule result<br/>** Rule processing time
+    deactivate rules
 
-autonumber
+    activate typologies
+    typologies ->> typologies: Collect rule results
+    typologies ->> typologies: Calculate typology score
+    typologies ->> tadp: Submit typology result
+    Note left of typologies: Typology results include:<br/>* Original transaction data<br/>* Network sub-map<br/>* Typology scoring results<br/>** Typology processor identifier<br/>** Typology identifier (configuration)<br/>** Typology score<br/>** Typology alert threshold<br/>** Typology interdiction threshold<br/>** Typology processing time<br/>** Array of rule evaluation results<br/>*** Rule processor identifier<br/>*** Rule configuration version<br/>*** Sub-rule reference<br/>*** Rule result<br/>*** Rule processing time<br/>*** Rule weighting
+    deactivate typologies
 
-skinparam backgroundColor #White
-skinparam handwritten false
-skinparam shadowing false
-
-skinparam ParticipantPadding 20
-skinparam BoxPadding 10
-
-hide footbox
-
-' title Tazama Processor Results Propagation
-
-' declare actors
-participant "RulesnProcessor" as rules
-participant "TypologynProcessors" as typologies
-participant "TransactionnAggregationn&amp;amp; DecisioningnProcessor" as tadp
-participant "CasenManagement" as cms
-
-' start flow
-
-activate rules
-rules -> rules: Execute rule
-rules -> typologies: Submit rule result
-note left
-    Rule results include:
-    * Original transaction data
-    * Network sub-map
-    * Rule evaluation results
-    ** Rule processor identifier
-    ** Rule configuration version
-    ** Sub-rule reference
-    ** Rule result
-    ** Rule processing time
-end note
-deactivate rules
-
-activate typologies
-typologies -> typologies: Collect rule results
-typologies -> typologies: Calculate typology score
-typologies -> tadp: Submit typology result
-note left
-    Typology results include:
-    * Original transaction data
-    * Network sub-map
-    * Typology scoring results
-    ** Typology processor identifier
-    ** Typology identifier (configuration)
-    ** Typology score
-    ** Typology alert threshold
-    ** Typology interdiction threshold
-    ** Typology processing time
-    ** Array of rule evaluation results
-    *** Rule processor identifier
-    *** Rule configuration version
-    *** Sub-rule reference
-    *** Rule result
-    *** Rule processing time
-    *** Rule weighting
-end note
-deactivate typologies
-
-activate tadp
-tadp -> tadp: Collect typology results
-tadp -> tadp: Complete channel result
-note left
-    Channel results include:
-    * Original transaction data
-    * Network sub-map
-    * Channel evaluation results
-    ** Channel id
-    ** Channel processing time
-    ** Array of typology evaluation results
-    *** Array of rule evaluation results
-end note
-
-tadp -> tadp: Collect channel results
-tadp -> tadp: Determine alert status
-tadp -> cms: Submit transaction result
-note left
-    Transaction results include:
-    * Transaction (alert) id
-    * Original transaction data
-    * Network sub-map
-    * Transaction evaluation results
-    ** Evaluation identifier
-    ** Evaluation status
-    ** Evaluation timestamp
-    ** Evaluation processing time
-    ** Transaction evaluation result
-    *** Array of channel evaluation results
-    **** Array of typology evaluation results
-    ***** Array of rule evaluation results
-end note
-deactivate tadp
-activate cms
-deactivate cms
-@enduml
+    activate tadp
+    tadp ->> tadp: Collect typology results
+    tadp ->> tadp: Collect typology results
+    tadp ->> tadp: Determine alert status
+    tadp ->> cms: Submit transaction result
+    Note left of tadp: Transaction results include:<br/>* Transaction (alert) id<br/>* Original transaction data<br/>* Network sub-map<br/>* Transaction evaluation results<br/>** Evaluation identifier<br/>** Evaluation status<br/>** Evaluation timestamp<br/>** Evaluation processing time<br/>** Transaction evaluation result<br/>*** Array of typology evaluation results<br/>**** Array of rule evaluation results
+    deactivate tadp
+    activate cms
+    deactivate cms
 ```
 
 1. Each rule processor delivers its results to the Typology Processor.
 2. The typology processor aggregates the results from a number of rules associated with a specific typology into a typology result.
